import 'package:flutter/material.dart';

class Constant{
  
  static const  Color bgColor =  Color.fromARGB(255, 237,237,237) ;
  static   List<String> placeCatigoryList = [
    'مطعم ',
    'ملعب ',
    'كافية ',
    'صيدلية',
    'نادى',
    'اخري',
  ];
  static   List<String> goverNoRate = [
    'الإسكندرية',
    'الإسماعيلية',
    'أسوان',
    'الأقصر',
    'البحر الأحمر',
    'البحيرة',
    'بني سويف',
    'بورسعيد',
    'جنوب سيناء',
    'الجيزة',
    'الدقهلية',
    'دمياط',
    'سوهاج',
    'السويس',
    'الشرقية',
    'شمال سيناء',
    'الغربية',
    'الفيوم',
    'القاهرة',
    'القليوبية',
    'قنا',
    'كفر الشيخ',
    'مطروح',
    'المنوفية',
    'المنيا',
    'الوادي الجديد',
  ];
}