import 'package:egy_tour_guide/widgets/my_text.dart';
import 'package:flutter/material.dart';

import '../../taps.dart';

// ignore: use_key_in_widget_constructors
class PrivacyPolicy extends StatelessWidget {
  static const String privacy = 'pray';
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 0,
        leading: IconButton(
          onPressed: () {
            Navigator.of(context).pushReplacementNamed(TapsScreen.tapsRoute);
          },
          icon: const Icon(Icons.arrow_back_ios),
        ),
        title: const Text("سياسة الخصوصية"),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Column(children: const [
          Padding(
            padding: EdgeInsets.all(20.0),
            child: MyText(
              lines: 100,
              title: '''
      انطلاقاً من حرصها على بيانات عملائها وسرية معلوماتهم على الإنترنت، وضع التطبيق  مجموعة من البنود توضح فيها سياستها في الحفاظ على خصوصية زوار هذا الموقع، وكيفية تعاملنا مع بياناتهم الشخصية.
      نرحب بكافة زوارنا الكرام في تطبيق كتالوج السياحة الداخلية، ونود أن نعلمكم أن تصفحكم لهذا الموقع يتضمن موافقتكم الضمنية على شروط استخدام  كتالوج السياحة الداخلية  وسياسة الخصوصية الخاصة بنا.
      تستخدم سفرك السياحية المعلومات والبيانات المقدمة من قبل الزوار بمحض إرادتهم، وبمعرفتهم الكاملة بالبيانات التي يزودوننا بها، حيث أننا لا نجمع البيانات الشخصية لمتصفحي الموقع أبداً دون رغبتهم بذلك أثناء تصفحهم موقعنا.
      علماً أنّه عند زيارة أي موقع إلكتروني بما في ذلك تطبيق كتالوج السياحة الداخلية، يقوم المخدم المضيف بتسجيل البيانات التالية على الأقل:
      عنوان برتوكول الإنترنت الخاص بجهازك IP: The Internet Protocol.
      تاريخ وموعد دخولك موقعنا، وكذلك نوع المتصفح الذي تستخدمه.
      وأيضاً عنوان أي موقع خارجي تم تحويلك من خلاله إلينا.
      قد يحتوي موقع سفرك السياحية على روابط خارجية لمواقع أخرى، نحن غير مسؤولين عن سياسة الخصوصية ومحتوى ومضمون تلك المواقع، لذا نرجو من عملائنا الكرام التفضل بالاطلاع على سياسة الخصوصية الخاصة بتلك المواقع قبل تصفحها.
      سنبذل قصارى جهدنا للمحافظة دائماً على خصوصية وسرية كافة البيانات والمعلومات الشخصية التي قبلتَ بتزويدنا بها، إلا إذا كان ذلك مطلوباً بموجب أي قانون أو تشريعات جديدة، أو عندما نعتقد (بدون سوء نية) أن مثل هذا الإجراء سيكون مطلوباً أو مرغوباً فيه للتماشي مع القانون، أو للدفاع عنك، أو حماية حقوق الملكية الخاصة بسفرك السياحية، أو نتيجة لتعرض بيانات هذا الموقع لعمليات ولوج غير قانونية، علماً أننا قد نعمل باستمرار على تحسين وتطوير إجراءات الأمان لدينا، وفقاً لأحدث التقنيات المتاحة في العتاد والبرمجيات.
      معلومات التواصل التي ترسلها لنا بإرادتك أو نطلبها منك لنساعدك في اختيار ما يناسبك من خيارات السياحة أو السفر أو أية خدمات أخرى مثل حجوزات الطيران والفنادق وغيرها، نلتزم بخصوصيتها وسرّيتها، فلا نرسلها أو نبيعها لأي طرف ثالث إطلاقاً، دون الحصول على موافقتك المكتوبة سلفاً، وستبقى المعلومات ضمن أرشيفنا على هيئة بيانات جماعية خاصة، لا تستخدم إلا في التطبيق الإحصائي والبحثي دون إشهارها أو استخدامها على نحو يمكن فيه التعريف بك.
      البيانات التي يتم تقديمها من قبلك – بما في ذلك بيانات التقييم الشخصي ورأيك بالموقع والخدمات التي يقدمها – سيتم استخدامها في الرد على كافة استفساراتك، وملاحظاتك، أو طلباتك من قبل فريق تطبيق السياحة الداخلية أو أي من المواقع التابعة له، كما يمكن أن يتم استخدامها لتحسين تجربة المستخدم على الموقع دون الإفصاح عنها لطرف ثالث.
      لن نقوم ببيع، أو مقايضة، أو تأجير، أو إفشاء أية معلومات شخصية لمصلحة أي طرف آخر خارج هذا الموقع، أو المواقع التابعة له، بما في ذلك: بيانات الاتصال و/ أو الأسماء والصور وغيرها، وسيتم الكشف عن المعلومات فقط في حالة صدور أمر بذلك من قبل سلطة قضائية أو تنظيمية معتبرة قانوناً.
      يحتفظ موقع سفرك السياحية بحق تعديل بنود وشروط سياسة خصوصية المعلومات والسرية إن لزم الأمر، ومتى كان ذلك ملائماً، وسيتم بصفة مستمرة إخطارك بالتغييرات المحتملة، أو البيانات التي حصلنا عليها، وكيف سنستخدمها، والجهة التي سنقوم بتزويدها بهذه البيانات.
      عند الحاجة أو الضرورة يسعدنا تواصلكم معنا وإرسال استفساراتكم إلى بريدنا الإلكتروني info@safaraq.com
       
      إن مخاوفك ومحاذيرك بشأن سرية وخصوصية بياناتك تعتبر مسألة في غاية الأهمية بالنسبة إلينا، نأمل أن نكون قد حافظنا عليها من خلال هذه السياسة الواضحة والصريحة.
      
      ''',
            ),
          )
        ]),
      ),
    );
  }
}
